#------------------------------#
# Brew formula
#------------------------------#

brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'gibo'
brew 'repo'
brew 'tig'
brew 'fish'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'z'
brew 'aria2'
brew 'wget'
brew 'curl'
brew 'httpie'
brew 'mitmproxy'
brew 'watch'
brew 'tree'
brew 'pstree'
brew 'ncdu'
brew 'rename'
brew 'osquery'
brew 'jq'
brew 'python-yq'
brew 'jid'
brew 'jsonpp'
brew 'mtr'
brew 'vegeta'
brew 'nnn'
brew 'direnv'
brew 'rbenv'
brew 'ruby-build'
brew 'plenv'
brew 'perl-build'
brew 'pyenv'
brew 'pipenv'
brew 'goenv'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'bat'
brew 'fd'
brew 'emacs'
brew 'mg'
brew 'vim', args: ['with-lua']
brew 'vimpager'
brew 'maven'
brew 'n'
brew 'yarn', args: ['without-node']
brew 'gradle'
brew 'pidcat'
brew 'groovy'
brew 'dex2jar'
brew 'apktool'
brew 'scrcpy'
brew 'prototool'
brew 'peco'
brew 'fzf'
brew 'mkcert'
brew 'nss'
brew 'hadolint'
brew 'yamllint'
brew 'plantuml'
brew 'graphviz'
brew 'gpg2'
brew 'highlight'
brew 'urlview'
brew 'extract_url'
brew 'kotlin'
brew 'translate-shell'
brew 'm-cli'
brew 'terminal-notifier'
brew 'tldr'
brew 'bcal'
brew 'webp'
brew 'pngquant'
brew 'optipng'
brew 'brotli'
brew 'zopfli'
brew 'loc'
brew 'multimarkdown'
brew 'ssh-copy-id'
brew 'mupdf-tools'
brew 'ffmpeg', args: ['with-libvpx', 'with-fdk-aacf', 'with-sdl2', 'with-freetype', 'with-libass', 'with-libquvi', 'with-libvorbis', 'with-libvpx', 'with-opus', 'with-x265', 'with-webp', 'with-fontconfig']
brew 'bento4'
brew 'imagemagick', args: ['with-fontconfig']
brew 'giflossy'
brew 'youtube-dl'
brew 'newsboat'
brew 'ddgr'

## Optional
#brew 'kubectx'
#brew 'kustomize'
#brew 'terraform'
#brew 'docker'
#brew 'dvm'
#brew 'dfu-programmer'
#brew 'go-jira'
#brew 'poppler'
#brew 'pdfgrep'


#------------------------------#
# Cask
#------------------------------#

tap 'caskroom/cask'

cask 'alfred'
cask 'iterm2'
cask 'visual-studio-code'
cask 'android-sdk'
cask 'android-file-transfer'
cask 'androidtool'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'hex-fiend'
cask 'ngrok'
cask 'typora'
cask 'mi'
cask 'pixel-picker'


## Optional

#cask 'dash'
#cask 'dropbox'
#cask 'virtualbox'
#cask 'vagrant'
#cask 'genymotion'
#cask 'trailer'
#cask 'hammerspoon'
#cask 'obs'
#cask 'gitup'
#cask 'avidemux'
#cask 'iina'
#cask 'bathyscaphe'
#cask 'balenaetcher'


#------------------------------#
# Third-party taps
#------------------------------#

tap 'ogaclejapan/ext'
brew 'ogaclejapan/ext/drive'
brew 'ogaclejapan/ext/markdown-renderer'
brew 'ogaclejapan/ext/jd-cmd'

tap 'cjbassi/gotop'
brew 'gotop'

tap 'tsduck/tsduck'
brew 'tsduck'

#------------------------------#
# vim: ft=sh
#------------------------------#
