#------------------------------#
# Brew formula
#------------------------------#

brew 'emacs'
brew 'mg'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gh'
brew 'gibo'
brew 'repo'
brew 'tig'
brew 'fish'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'shellcheck'
brew 'aria2'
brew 'wget'
brew 'curl'
brew 'httpie'
brew 'mitmproxy'
brew 'just'
brew 'watchexec'
brew 'watch'
brew 'htop'
brew 'tree'
brew 'pstree'
brew 'procs'
brew 'ncdu'
brew 'rename'
brew 'jq'
brew 'python-yq'
brew 'mtr'
brew 'vegeta'
brew 'broot'
brew 'direnv'
brew 'rbenv'
brew 'ruby-build'
brew 'plenv'
brew 'perl-build'
brew 'pyenv'
brew 'pipenv'
brew 'tfenv'
brew 'terragrunt', args: ['ignore-dependencies']
brew 'go'
brew 'n'
brew 'yarn'
brew 'jenv'
brew 'kotlin'
brew 'gradle'
brew 'maven'
brew 'dive'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'fselect'
brew 'bat'
brew 'fd'
brew 'prototool'
brew 'peco'
brew 'fzf'
brew 'mkcert'
brew 'nss'
brew 'hadolint'
brew 'yamllint'
brew 'plantuml'
brew 'graphviz'
brew 'gpg2'
brew 'gopass'
brew 'sops'
brew 'highlight'
brew 'urlview'
brew 'extract_url'
brew 'translate-shell'
brew 'm-cli'
brew 'terminal-notifier'
brew 'dssim'
brew 'gifsicle'
brew 'jpeg-archive'
brew 'jpeg'
brew 'webp'
brew 'pngquant'
brew 'optipng'
brew 'brotli'
brew 'zopfli'
brew 'pigz'
brew 'loc'
brew 'multimarkdown'
brew 'ssh-copy-id'
brew 'mupdf-tools'
brew 'youtube-dl'


## Optional ##

#brew 'vim', args: ['with-lua']
#brew 'vimpager'
#brew 'dfu-programmer'
#brew 'go-jira'
#brew 'qpdf'
brew 'ffmpeg'
#brew 'bento4'
#brew 'imagemagick', args: ['with-fontconfig']
#brew 'dex2jar'
#brew 'apktool'
#brew 'scrcpy'
#brew 'pidcat'


#------------------------------#
# Cask
#------------------------------#

tap 'homebrew/cask'

cask 'alfred'
cask 'iterm2'
cask 'visual-studio-code'
cask 'android-file-transfer'
cask 'imageoptim'
cask 'karabiner-elements'
cask 'hex-fiend'
cask 'ngrok'
cask 'typora'
cask 'mi'
cask 'pixel-picker'


## Optional ##

cask 'multipass'
#cask 'dash'
#cask 'dropbox'
#cask 'virtualbox'
#cask 'vagrant'
#cask 'genymotion'
#cask 'trailer'
#cask 'hammerspoon'
#cask 'obs'
#cask 'gitup'
#cask 'avidemux'
#cask 'iina'
cask 'bathyscaphe'
#cask 'balenaetcher'


#------------------------------#
# Third-party taps
#------------------------------#

#tap 'ogaclejapan/ext'
#brew 'ogaclejapan/ext/drive'
#brew 'ogaclejapan/ext/markdown-renderer'
#brew 'ogaclejapan/ext/jd-cmd'

tap 'cjbassi/ytop'
brew 'ytop'


## Optional ##

#tap 'tsduck/tsduck'
#brew 'tsduck'


#------------------------------#
# vim: ft=sh
#------------------------------#
