#------------------------------#
# Brew formula
#------------------------------#

brew 'emacs'
brew 'nano'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gitmoji'
brew 'gh'
brew 'gibo'
brew 'fish'
brew 'starship'
brew 'tmux'
brew 'shellcheck'
brew 'shfmt'
brew 'wget'
brew 'curl'
brew 'mitmproxy'
brew 'watchexec'
brew 'watch'
brew 'bottom'
brew 'tree'
brew 'pstree'
brew 'dust'
brew 'rename'
brew 'jq'
brew 'jo'
brew 'python-yq'
brew 'mtr'
brew 'direnv'
brew 'rbenv'
brew 'ruby-build'
brew 'plenv'
brew 'perl-build'
brew 'pyenv'
brew 'pipenv'
brew 'tfenv'
# https://github.com/gruntwork-io/terragrunt/issues/580
# brew 'terragrunt'
brew 'go'
brew 'nodenv'
brew 'node-build'
brew 'yarn'
brew 'kotlin'
brew 'gradle'
brew 'maven'
brew 'dive'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'fselect'
brew 'bat'
brew 'fd'
brew 'peco'
brew 'fzf'
brew 'mkcert'
brew 'nss'
brew 'hadolint'
brew 'yamllint'
brew 'plantuml'
brew 'graphviz'
brew 'gpg2'
brew 'gopass'
brew 'sops'
brew 'age'
brew 'highlight'
brew 'urlview'
brew 'extract_url'
brew 'translate-shell'
brew 'm-cli'
brew 'terminal-notifier'
brew 'multimarkdown'
brew 'ssh-copy-id'


## Optional ##

#brew 'vim', args: ['with-lua']
#brew 'vimpager'
#brew 'dfu-programmer'
#brew 'go-jira'
#brew 'qpdf'
#brew 'ffmpeg'
#brew 'bento4'
#brew 'imagemagick', args: ['with-fontconfig']
#brew 'apktool'
#brew 'jadx'
#brew 'scrcpy'
#brew 'pidcat'
#brew 'aria2'
#brew 'httpie'
#brew 'just'
#brew 'vegeta'
#brew 'tig'
#brew 'prototool'
#brew 'youtube-dl'
#brew 'mupdf-tools'
#brew 'dssim'
#brew 'gifsicle'
#brew 'jpeg-archive'
#brew 'jpeg'
#brew 'webp'
#brew 'pngquant'
#brew 'optipng'
#brew 'brotli'
#brew 'zopfli'
#brew 'pigz'
#brew 'loc'
#brew 'krew'
#brew 'k9s'
#brew 'octant'
#brew 'zstd'


#------------------------------#
# Cask
#------------------------------#

tap 'homebrew/cask'

cask 'karabiner-elements'
cask 'iterm2'
cask 'alfred'
cask 'rectangle'
cask 'visual-studio-code'
cask 'mi'
cask 'imageoptim'


## Optional ##

#cask 'android-file-transfer'
#cask 'virtualbox'
#cask 'vagrant'
#cask 'multipass'
#cask 'dash'
#cask 'dropbox'
#cask 'genymotion'
#cask 'trailer'
#cask 'hammerspoon'
#cask 'obs'
#cask 'gitup'
#cask 'avidemux'
#cask 'iina'
#cask 'bathyscaphe'
#cask 'balenaetcher'
#cask 'hex-fiend'
#cask 'ngrok'
#cask 'pixel-picker'
#cask 'typora'
#cask 'wireshark'


#------------------------------#
# Third-party taps
#------------------------------#

#tap 'ogaclejapan/ext'
#brew 'ogaclejapan/ext/drive'
#brew 'ogaclejapan/ext/markdown-renderer'
#brew 'ogaclejapan/ext/jd-cmd'

tap 'homebrew/cask-fonts'
cask 'font-ubuntu-mono-nerd-font'

tap 'cjbassi/ytop'
brew 'ytop'


tap 'facebook/fb'
brew 'idb-companion'


# https://github.com/wader/fq
#tap 'wader/tap'
#brew 'fq'


## Optional ##

#tap 'tsduck/tsduck'
#brew 'tsduck'


#------------------------------#
# vim: ft=sh
#------------------------------#
